print ( 2 * 3 ** 2 - 1 )
print ( 2 * 3 ** (2 - 1 ))
print ( 2 ** 3 ** 4)
print ( (2 ** 3) ** 4)

#Задача 1. Фруктовый сад
a, b, c = 8, 5, 3
print ((a / (b + c) - a) / c)

#Задача 2. Автобус или метро?
bus = 5
metro = 3
result = ((6 + (10 - bus) ** 2) / (metro + 1)) + (132 / (2 + bus))
print(result)

#Задача 3. Сложные степени
print ( (-3 + (8 **2 - 12) * 4 ** 3 ** 2 ) / (2 * 18) )