#bank = int(input ('Сколько денег на счету? '))
#if bank > 75000:
#    bank -= 75000
#    print ("Курс успешно приобретен")
#    print (bank)

#Задача 1. Сбой
a = 6
b = 2
c = 0
if 2 < 6:
    c = a * b
print (c)

#Задача 3. Дружба
number = int(input("Введите число: "))
if number % 2 == 0:
    print("Число чётное")