# 5.7 Тренажёр «Функция»
# Перед выполнением кода раскомментируйте переменную x (то есть удалите символ комментария # из строки с переменной). Это позволит вам протестировать свой код на разных значениях переменной.
# Перед отправкой кода на проверку снова закомментируйте эту строку — система сама подставит разные значения для проверки вашего кода.

# x = 0

# Напишите свой код ниже.
if x == 0:
    y = 5
elif x < 0:
    y = x ** 2
else:
    y = x - 12

print('Игрек равен', y)
