#number = int(input('Введите число: '))
#total = 0
#while number != 0:
#    total += number
#    number = int(input('Введите число: '))
#print(total)

#Задача 2. Закономерности
a = 0
while a < 98:
    a +=7
    print (a )

# Вариант с выводом чисел в одну строку:
number = 0
while number < 98:
    number += 7
    print(number, end=' ')