#Задача 1. Язык математики
a = 8
b = 10
c = 12
d = 18
res = (( -3 + a ** 2 ) * b - 2 ** 3 ) / (c - 2 * d)
print ('Ответ:', res)

#Задача 2. Финансовый отчёт
#a = int(input ('введите a: '))
#b = int(input ('введите b: '))
#c = int(input ('введите c: '))
#d = int(input ('введите d: '))
#sum1 = a + b
#sum2 = c + d
#div = sum1 / sum2
#print(sum1, sum2)
#print(div)

#Задача 3. Следующее и предыдущее числа
#a = int(input ('введите число: '))
#print ('После числа', a, 'идёт число', a + 1)
#print ('До числа', a, 'идёт число', a - 1)

#Задача 4. Площадь треугольника
#a = int(input ('введите катет a: '))
#b = int(input ('введите катет b: '))
#s = a * b / 2
#print ('Площадь треугольника равна', s )



