# Задача 5. Недоделка
# Вы пришли на работу в компанию по разработке игр, целевая аудитория — дети и их родители. 
# У предыдущего программиста было задание сделать две игры в одном приложении, чтобы пользователь мог выбирать одну из них. 
# Однако программист, на место которого вы пришли, перед увольнением не успел выполнить эту задачу и оставил только небольшой шаблон проекта.

# Правила игры «Камень, ножницы, бумага»: программа запрашивает у пользователя строку и выводит, победил он или проиграл. 
# Камень бьёт ножницы, ножницы режут бумагу, бумага кроет камень.

# Правила игры «Угадай число»: программа запрашивает у пользователя число до тех пор, пока он не угадает загаданное.

# Что нужно сделать
# Используя этот шаблон проекта, реализуйте игры «Камень, ножницы, бумага» и «Угадай число».

def rock_paper_scissors():
  # Здесь будет игра «Камень, ножницы, бумага»

def guess_the_number():
  # Здесь будет игра «Угадай число»

def main_menu():
  # Здесь главное меню игры

main_menu()